ZigEmbeddedGroup/microzig/port/wch/ch32v/src/chips/ch32v30x.svd
			<register>
			<name>UEP8_TX_DMA</name>
			<description>endpoint 8 DMA TX buffer address</description>
			<addressOffset>0x78</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_TX_DMA</name>
					<description> endpoint 8 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP9_TX_DMA</name>
			<description>endpoint 9 DMA TX buffer address</description>
			<addressOffset>0x7C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_TX_DMA</name>
					<description> endpoint 9 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP10_TX_DMA</name>
			<description>endpoint 10 DMA TX buffer address</description>
			<addressOffset>0x80</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_TX_DMA</name>
					<description> endpoint 10 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP11_TX_DMA</name>
			<description>endpoint 11 DMA TX buffer address</description>
			<addressOffset>0x84</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_TX_DMA</name>
					<description> endpoint 11 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_TX_DMA____UH_SPLIT_DATA</name>
			<description>endpoint 12 DMA TX buffer address</description>
			<addressOffset>0x88</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_TX_DMA___UH_SPLIT_DATA</name>
					<description> endpoint 12 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP13_TX_DMA</name>
			<description>endpoint 13 DMA TX buffer address</description>
			<addressOffset>0x8C</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_TX_DMA</name>
					<description> endpoint 13 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP14_TX_DMA</name>
			<description>endpoint 14 DMA TX buffer address</description>
			<addressOffset>0x90</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_TX_DMA</name>
					<description> endpoint 14 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP15_TX_DMA</name>
			<description>endpoint 15 DMA TX buffer address</description>
			<addressOffset>0x94</addressOffset>
			<size>0x20</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP15_TX_DMA</name>
					<description> endpoint 15 DMA buffer address</description>
					<bitRange>[31:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP0_MAX_LEN</name>
			<description>endpoint 0 max acceptable length</description>
			<addressOffset>0X98</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_MAX_LEN</name>
					<description> endpoint 0 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_MAX_LEN</name>
			<description>endpoint 1 max acceptable length</description>
			<addressOffset>0X9C</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_MAX_LEN</name>
					<description> endpoint 1 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_MAX_LEN__UH_RX_MAX_LEN</name>
			<description>endpoint 2 max acceptable length</description>
			<addressOffset>0xA0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_MAX_LEN__UH_RX_MAX_LEN</name>
					<description> endpoint 2 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_MAX_LEN</name>
			<description>endpoint 3 MAX_LEN TX </description>
			<addressOffset>0xA4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_MAX_LEN</name>
					<description> endpoint 3 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_MAX_LEN</name>
			<description>endpoint 4 max acceptable length </description>
			<addressOffset>0xA8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_MAX_LEN</name>
					<description> endpoint 4 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_MAX_LEN</name>
			<description>endpoint 5 max acceptable length</description>
			<addressOffset>0xAC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_MAX_LEN</name>
					<description> endpoint 5 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_MAX_LEN</name>
			<description>endpoint 6 max acceptable length</description>
			<addressOffset>0xB0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_MAX_LEN</name>
					<description> endpoint 6 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_MAX_LEN</name>
			<description>endpoint 7 max acceptable length</description>
			<addressOffset>0xB4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_MAX_LEN</name>
					<description> endpoint 7 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_MAX_LEN</name>
			<description>endpoint 8 max acceptable length</description>
			<addressOffset>0xB8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_MAX_LEN</name>
					<description> endpoint 8 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP9_MAX_LEN</name>
			<description>endpoint 9 max acceptable length</description>
			<addressOffset>0xBC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_MAX_LEN</name>
					<description> endpoint 9 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP10_MAX_LEN</name>
			<description>endpoint 10 max acceptable length</description>
			<addressOffset>0xC0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_MAX_LEN</name>
					<description> endpoint 10 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP11_MAX_LEN</name>
			<description>endpoint 11 max acceptable length</description>
			<addressOffset>0xC4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_MAX_LEN</name>
					<description> endpoint 11 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_MAX_LEN</name>
			<description>endpoint 12 max acceptable length</description>
			<addressOffset>0xC8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_MAX_LEN</name>
					<description> endpoint 12 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP13_MAX_LEN</name>
			<description>endpoint 13 max acceptable length</description>
			<addressOffset>0xCC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_MAX_LEN</name>
					<description> endpoint 13 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP14_MAX_LEN</name>
			<description>endpoint 14 max acceptable length</description>
			<addressOffset>0xD0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_MAX_LEN</name>
					<description> endpoint 14 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP15_MAX_LEN</name>
			<description>endpoint 15 max acceptable length</description>
			<addressOffset>0xD4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP15_MAX_LEN</name>
					<description> endpoint 15 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			
			<register>
			<name>UEP0_T_LEN</name>
			<description>endpoint 0 send the length</description>
			<addressOffset>0xD8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_T_LEN</name>
					<description> endpoint 0 send the length</description>
					<bitRange>[6:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP0_TX_CTRL</name>
			<description>endpoint 0  send control</description>
			<addressOffset>0xDA</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 0 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 0 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 0 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP0_RX_CTRL</name>
			<description>endpoint 0  send control</description>
			<addressOffset>0xDB</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 0 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 0 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 0 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
			<register>
			<name>UEP1_T_LEN</name>
			<description>endpoint 1 send the length</description>
			<addressOffset>0xDC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_T_LEN</name>
					<description> endpoint 1 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP1_TX_CTRL</name>
			<description>endpoint 1  send control</description>
			<addressOffset>0xDE</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 1 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 1 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 1 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP1_RX_CTRL</name>
			<description>endpoint 1  send control</description>
			<addressOffset>0xDF</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 1 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 1 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 1 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
			<register>
			<name>UEP2_T_LEN__UH_EP_PID</name>
			<description>endpoint 2 send the length</description>
			<addressOffset>0xE0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_T_LEN__MASK_UH_ENDP__MASK_UH_TOKEN</name>
					<description> endpoint 2 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP2_TX_CTRL</name>
			<description>endpoint 2  send control</description>
			<addressOffset>0xE2</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 2 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 2 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 2 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP2_RX_CTRL__UH_RX_CTRL</name>
			<description>endpoint 2 send control</description>
			<addressOffset>0xE3</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES__MASK_UH_R_RES</name>
					<description> endpoint 2 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>bUH_R_RES_NO</name>
					<description> bUH_R_RES_NO</description>
					<bitRange>[2:2]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG__MASK_UH_R_TOG</name>
					<description> endpoint 2 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO__bUH_R_AUTO_TOG</name>
					<description> endpoint 2 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			<field>
			<name>RB_UH_R_DATA_NO</name>
					<description> bUH_R_DATA_NO</description>
					<bitRange>[6:6]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			
			<register>
			<name>UEP3_T_LEN___UH_TX_LEN_H</name>
			<description>endpoint 3 send the length</description>
			<addressOffset>0xE4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_T_LEN___UH_TX_LEN_H</name>
					<description> endpoint 3 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP3_TX_CTRL___UH_TX_CTRL</name>
			<description>endpoint 3  send control</description>
			<addressOffset>0xE6</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES_____MASK_UH_T_RES</name>
					<description> endpoint 3 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>bUH_T_RES_NO</name>
					<description>bUH_T_RES_NO</description>
					<bitRange>[2:2]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG____MASK_UH_T_TOG</name>
					<description> endpoint 3 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>RB_UEP_T_TOG_AUTO____bUH_T_AUTO_TOG</name>
					<description> endpoint 3 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			
			<field>
			<name>bUH_T_DATA_NO</name>
					<description> bUH_T_DATA_NO</description>
					<bitRange>[6:6]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP3_RX_CTRL</name>
			<description>endpoint 3  send control</description>
			<addressOffset>0xE7</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 3 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 3 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 3 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
			<register>
			<name>UEP4_T_LEN</name>
			<description>endpoint 4 send the length</description>
			<addressOffset>0xE8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_T_LEN</name>
					<description> endpoint 0 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP4_TX_CTRL</name>
			<description>endpoint 4  send control</description>
			<addressOffset>0xEA</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 4 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 4 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 4 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP4_RX_CTRL</name>
			<description>endpoint 4  send control</description>
			<addressOffset>0xEB</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description> endpoint 4 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description> endpoint 4 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_R_TOG_AUTO</name>
					<description> endpoint 4 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>	
			
			<register>
			<name>UEP5_T_LEN</name>
			<description>endpoint 5 send the length</description>
			<addressOffset>0xEC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_T_LEN</name>
					<description> endpoint 5 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP5_TX_CTRL</name>
			<description>endpoint 5  send control</description>
			<addressOffset>0xEE</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description> endpoint 5 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description> endpoint 5 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>RB_UEP_T_TOG_AUTO</name>
					<description> endpoint 5 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
